       IDENTIFICATION DIVISION.
       PROGRAM-ID. pzh_mid_price.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 WS-BID PIC S9(10)V9(8) COMP-3 VALUE ZERO.
       77 WS-ASK PIC S9(10)V9(8) COMP-3 VALUE ZERO.
       77 WS-RES PIC S9(10)V9(8) COMP-3 VALUE ZERO.

       LINKAGE SECTION.

       77 LK-BEST-BID-PRICE USAGE COMP-2.
       77 LK-BEST-ASK-PRICE USAGE COMP-2.
       77 LK-RESULT         USAGE COMP-2.

       PROCEDURE DIVISION USING  LK-BEST-BID-PRICE LK-BEST-ASK-PRICE 
                                 LK-RESULT.

           MOVE LK-BEST-BID-PRICE TO WS-BID.
           MOVE LK-BEST-ASK-PRICE TO WS-ASK.

           ADD WS-BID TO WS-ASK GIVING WS-RES.

           DIVIDE WS-RES BY 2 GIVING WS-RES.

           DISPLAY WS-RES.

           MOVE WS-RES TO LK-RESULT.

           GOBACK.
